
class PTrains:
    __personality_traits = ["Авантюризм", "Агрессивность", "Алчность", "Асоциальность", "Благородство", "Вежливость",
                          "Гениальность",
                          "Грубость", "Гуманность", "Дерзость", "Дилетантизм", "Дисциплинированность", "Доверчивость",
                          "Застенчивость",
                          "Импульсивность", "Инициативность", "Искренность", "Коварство", "Коммуникабельность",
                          "Лицемерность", "Мудрость",
                          "Ответственность", "Пессимистичность", "Подлость", "Пунктуальность", "Решительность",
                          "Самоотверженность",
                          "Сдержанность", "Сентиментальность", "Стрессоустойчивость", "Терпимость", "Тревожность",
                          "Трудоголизм", "Тунеядство",
                          "Фанатизм", "Честность", "Эгоизм", "Чувство юмора", "Эгоцентризм"]

    def get_peronality_trains(self):
        return self.__personality_traits

